# git init - превращает текущую директорию в git зепозиторий (создается .git)
# git add . (. - все файлы можно указывть отдельные файлы) - отслеживание всех файлов)
# git commit -m "comnit" - добавляет/соверщает собранение в git всех файлов которые  находятся в индексе
# git log - выводит журнал (log) сохранений
# git status - показывает статус файлов
# git remote add origin (название связи - обычно origin) SSH (ссылка на удаленный репозиторий)
# git checkout hash_commit - просматриваем версию
# dit branch - выводит в терминал список всех веток (звездочкой помечена активная ветка)
# dit checkout <название_ветки>
#                                 - переход на указанную ветку
# git switch <название ветки>
# git push origin(название_связи) master(название_ветки) - отправка версии кода на удаленный репозиторий

    

# git clone <ссылка_на_удаленный_репозиторий> - склонировать/скопировать/скачать репозиторий
